NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD

#define ASSIST_DEBUG_CORE_STRIDE (ASSIST_DEBUG_CORE_1_INTR_ENA_REG - ASSIST_DEBUG_CORE_0_INTR_ENA_REG)

_Static_assert(ASSIST_DEBUG_CORE_STRIDE == 0x80, "UMODE_CORE_OFF in umode.S shifts mhartid by 7 to reach "
                                                 "the current core's assist_debug block");

#define UMODE_STRIDE_OK(reg) \
  (ASSIST_DEBUG_CORE_1_##reg - ASSIST_DEBUG_CORE_0_##reg == ASSIST_DEBUG_CORE_STRIDE)

_Static_assert(UMODE_STRIDE_OK(INTR_RAW_REG), "assist_debug INTR_RAW is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(INTR_CLR_REG), "assist_debug INTR_CLR is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(SP_MIN_REG), "assist_debug SP_MIN is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(SP_MAX_REG), "assist_debug SP_MAX is not one stride apart per core");
_Static_assert(UMODE_STRIDE_OK(SP_PC_REG), "assist_debug SP_PC is not one stride apart per core");

/* The stride only means anything if there is more than one block to stride
 * between, and this demo wants one window per core, so it needs exactly the
 * two it knows how to address.
 */

_Static_assert(SOC_CPU_CORES_NUM == 2, "the assist_debug stride arithmetic assumes exactly two cores");

#endif

/* Nothing ties the slot count to the core count any more: a window is bounded
 * by its own core's interrupt mask rather than by an affinity, so any number of
 * windows can share any number of cores.  Two slots are kept because two is
 * enough to show two unpinned windows open at once.
 */

_Static_assert(USER_SLOTS >= 2, "one window proves nothing about two windows sharing the cores");

/* umode.S cannot include soc/clic_reg.h, so it carries its own copy of the
 * CLIC threshold address.  Keep the two honest.
 */

_Static_assert(
    UMODE_CLIC_THRESH_REG == CLIC_INT_THRESH_REG, "UMODE_CLIC_THRESH_REG no longer matches IDF's "
                                                  "CLIC_INT_THRESH_REG");
_Static_assert(UMODE_CLIC_THRESH_MASK == (CLIC_CPU_INT_THRESH_V << CLIC_CPU_INT_THRESH_S), "UMODE_CLIC_THRESH_MASK is not a full CLIC threshold mask");

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: kprintf / kwrite
 *
 * Description:
 *   Console output, serialised.  Two tasks print -- the kernel task and the
 *   host task on the user's behalf -- and without the mutex their lines
 *   interleave mid-word.
 *
 ****************************************************************************/
static void kprintf(const char *fmt, ...)
{
    va_list ap;

    xSemaphoreTake(g_console_mux, portMAX_DELAY);
    va_start(ap, fmt);
    vprintf(fmt, ap);
    va_end(ap);
    fflush(stdout);
    xSemaphoreGive(g_console_mux);
}

static void kwrite(const char *buf, uint32_t len)
{
    xSemaphoreTake(g_console_mux, portMAX_DELAY);
    fwrite(buf, 1, len, stdout);
    fflush(stdout);
    xSemaphoreGive(g_console_mux);
}

/****************************************************************************
 * Name: user_range_ok
 *
 * Description:
 *   Is [addr, addr + len) entirely inside THIS user's arena?
 *
 *   Every pointer that arrives from U-mode goes through here.  On this
 *   configuration IDF's locked PMP entry 5 would let U-mode hand us a pointer
 *   into kernel DRAM and the load would succeed, so this check -- not the
 *   hardware -- is what stops a user pointer being used to read the kernel.
 *
 *   With more than one user the bounds have to come from the SLOT rather than
 *   from a file-scope arena: entry 5 grants U-mode all of DRAM, so both arenas
 *   are equally reachable from either user, and a check against "the" arena
 *   would let user 0 read and write user 1's memory through the kernel.  The
 *   two users are isolated from each other here, in software, for exactly the
 *   same reason they are isolated from the kernel here rather than in the PMP.
 *
 ****************************************************************************/
static bool user_range_ok(const user_slot_t *u, uint32_t addr, uint32_t len)
{
    const uintptr_t lo = (uintptr_t) u->arena;
    const uintptr_t hi = lo + u->arena_size;

    if (len > u->arena_size)
    {
        return false;
    }

    /* addr + len cannot wrap once len is bounded by the arena size and addr is
     * at least lo, but check anyway -- the value came from U-mode.
     */

    if (addr < lo || addr > hi || (addr + len) < addr)
    {
        return false;
    }

    return (addr + len) <= hi;
}

/****************************************************************************
 * Name: user_strlen
 *
 * Description:
 *   Length of a NUL-terminated user string, bounded both by the arena and by
 *   max.  Returns -1 if the string is not terminated inside either.
 *
 ****************************************************************************/
static int user_strlen(const user_slot_t *u, uint32_t addr, uint32_t max)
{
    const uintptr_t hi = (uintptr_t) u->arena + u->arena_size;
    const char *p = (const char *) (uintptr_t) addr;
    uint32_t n;

    if (!user_range_ok(u, addr, 1))
    {
        return -1;
    }

    for (n = 0; n < max; n++)
    {
        if ((uintptr_t) &p[n] >= hi)
        {
            return -1;
        }

        if (p[n] == '\0')
        {
            return (int) n;
        }
    }

    return -1;
}

/****************************************************************************
 * Name: syscall_dispatch
 *
 * Description:
 *   Service one ecall from U-mode.  Runs in M-mode, in the host task, so
 *   blocking here is legal and is exactly how SYS_DELAY_MS works.
 *
 *   On the normal path this advances the saved pc past the ecall and writes
 *   the result into the saved a0, so umode_enter() resumes the user at the
 *   instruction after the trap with the return value in place.
 *
 * Returned Value:
 *   true to resume U-mode, false to retire the user context.
 *
 ****************************************************************************/
static bool syscall_dispatch(user_slot_t *u)
{
    umode_ctx_t *ctx = &u->ctx;
    const uint32_t nr = ctx->x[17];   /* a7 */
    const uint32_t arg0 = ctx->x[10]; /* a0 */
    const uint32_t arg1 = ctx->x[11]; /* a1 */
    uint32_t ret = 0;

