NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
    u->syscalls++;

    /* The trap arrived as ECALL_U rather than ECALL_M, which is the system's
     * own proof that the caller really was in U-mode.  Said once per user, so
     * the log carries the proof for BOTH of them independently.
     */

    if (!u->umode_confirmed)
    {
        u->umode_confirmed = true;
        kprintf(
            "KERNEL: %s: first syscall arrived with mcause=%08lx (ECALL from "
            "U-mode) on core %d -- user_main is running unprivileged\n",
            u->name, (unsigned long) ctx->mcause, xPortGetCoreID());
    }

    switch (nr)
    {
        case SYS_NOP:
            break;

        case SYS_WRITE:

            /* The user's own console output: a counted buffer, emitted verbatim */

            if (!user_range_ok(u, arg0, arg1))
            {
                kprintf(
                    "KERNEL: %s: SYS_WRITE rejected: buf=%08lx len=%lu outside "
                    "its arena\n",
                    u->name, (unsigned long) arg0, (unsigned long) arg1);
                ret = SYS_ERR_FAULT;
                break;
            }

            kwrite((const char *) (uintptr_t) arg0, arg1);
            ret = arg1;
            break;

        case SYS_PUTS:
            {
                /* The message-passing syscall: U-mode hands the kernel a string and
                 * the kernel prints it.  Copied out of the arena first so that what
                 * is printed cannot change under us.
                 */

                char msg[SYS_PUTS_MAX + 1];
                const char *src;
                int len;
                int i;

                len = user_strlen(u, arg0, SYS_PUTS_MAX);
                if (len < 0)
                {
                    kprintf(
                        "KERNEL: %s: SYS_PUTS rejected: msg=%08lx is not a "
                        "terminated string in its arena\n",
                        u->name, (unsigned long) arg0);
                    ret = SYS_ERR_FAULT;
                    break;
                }

                src = (const char *) (uintptr_t) arg0;
                for (i = 0; i < len; i++)
                {
                    msg[i] = src[i];
                }

                msg[len] = '\0';

                kprintf("%s\n", msg);
                ret = 0;
            }
            break;

        case SYS_DELAY_MS:

            /* U-mode is parked here, in M-mode, on a real FreeRTOS delay, so the
             * scheduler is free to run the kernel task meanwhile.
             */

            vTaskDelay(pdMS_TO_TICKS(arg0));
            break;

        case SYS_YIELD:

            /* Stay runnable, but give the scheduler a decision point.  This is
             * what lets a U-mode window move: a user that only ever sleeps is
             * woken by core 0 every time -- core 0 is the only core that walks
             * the delayed-task list -- and so never leaves it.
             */

            taskYIELD();
            break;

        case SYS_GETCORE:

            /* U-mode cannot read mhartid: it is a CSR, and a csr instruction
             * from U-mode is an illegal instruction.  Asking the kernel is the
             * only way the user can know where it is running, which is what
             * makes it worth printing -- the core number in the user's own
             * output line came back through the syscall interface.
             */

            ret = (uint32_t) xPortGetCoreID();
            break;

        case SYS_EXIT:
            kprintf("KERNEL: %s: user_main exited, status %lu\n", u->name, (unsigned long) arg0);
            return false;

        default:
            kprintf("KERNEL: %s: unknown syscall %lu from pc=%08lx\n", u->name, (unsigned long) nr, (unsigned long) ctx->pc);
            ret = SYS_ERR_BADNR;
            break;
    }

    ctx->pc += 4;     /* step past the ecall */
    ctx->x[10] = ret; /* a0 = return value   */
    return true;
}

/****************************************************************************
 * Name: report_fault
 *
 * Description:
 *   Anything that came back from U-mode which was neither a syscall nor an
 *   interrupt.  In a bigger system this is where a user thread would be
 *   killed; here it stops the context and says why.
 *
 ****************************************************************************/
static void report_fault(const user_slot_t *u)
{
    const umode_ctx_t *ctx = &u->ctx;
    const uint32_t code = ctx->mcause & MCAUSE_EXCCODE_MASK;
    const char *what;

    switch (code)
    {
        case EXC_INSN_MISALIGNED:
            what = "instruction misaligned";
            break;
        case EXC_INSN_ACCESS:
            what = "instruction access fault";
            break;
        case EXC_ILLEGAL_INSN:
            what = "illegal instruction";
            break;
        case EXC_BREAKPOINT:
            what = "breakpoint";
            break;
        case EXC_LOAD_MISALIGNED:
            what = "load misaligned";
            break;
        case EXC_LOAD_ACCESS:
            what = "load access fault";
            break;
        case EXC_STORE_MISALIGNED:
            what = "store misaligned";
            break;
        case EXC_STORE_ACCESS:
            what = "store access fault";
            break;
        case EXC_ECALL_M:
            what = "ecall from M-mode";
            break;
        default:
            what = "unexpected trap";
            break;
    }

    kprintf("KERNEL: %s: user fault: %s\n", u->name, what);
    kprintf("KERNEL:   mcause=%08lx mtval=%08lx pc=%08lx sp=%08lx ra=%08lx\n", (unsigned long) ctx->mcause, (unsigned long) ctx->mtval, (unsigned long) ctx->pc, (unsigned long) ctx->x[2], (unsigned long) ctx->x[1]);
}

/****************************************************************************
 * Name: report_stack_fault
 *
 * Description:
 *   The hardware stack guard fired on the user's stack during the window.
 *   This is the fault the kernel would otherwise have taken itself, several
 *   instructions later and under its own name; umode.S catches the latch on
 *   the way out so it can be attributed to the code that actually caused it.
 *
 ****************************************************************************/
static void report_stack_fault(const user_slot_t *u)
{
    const umode_ctx_t *ctx = &u->ctx;

    kprintf("KERNEL: %s: user fault: stack pointer left its arena\n", u->name);
    kprintf("KERNEL:   sp=%08lx allowed=%08lx..%08lx detected at pc=%08lx\n", (unsigned long) ctx->x[2], (unsigned long) ctx->u_sp_min, (unsigned long) ctx->u_sp_max, (unsigned long) ctx->sp_pc);
}

/****************************************************************************
 * Name: user_ctx_init
 *
 * Description:
 *   Build the initial U-mode context: entry point, a 16-byte aligned stack at
 *   the top of the arena, and a return address that turns a user_main() which
 *   returns into a SYS_EXIT rather than a wild branch.
 *
 *   gp and tp are deliberately left at zero here; umode.S does not load them,
 *   so U-mode inherits the kernel's and gp-relative addressing works.
 *
 *   a0 carries the slot's id, so the one user_main() in the image can tell
 *   which instance of itself it is.  Both users run that same code, from the
 *   same IRAM, at the same time -- it holds no writable state, so its locals
 *   live on whichever arena stack this context points at and the two
 *   instances never touch each other.
 *
 ****************************************************************************/
static void user_ctx_init(user_slot_t *u)
{
    umode_ctx_t *ctx = &u->ctx;
    uintptr_t stack_top;
    int i;

    for (i = 0; i < 32; i++)
    {
        ctx->x[i] = 0;
    }

